app/controllers/api/bucket_list_items_controller.rb

INSERT INTO "bucket_list_items" ("category", "name", "url", "completed", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["category", "food"], ["name", "adfasf"], ["url", ""], ["completed", false], ["created_at", "2020-05-08 06:16:28.397153"], ["updated_at", "2020-05-08 06:16:28.397153"], ["user_id", 1]]
---
    def create
        @bucket_list_item = BucketListItem.new(bucket_list_item_params)
        if @bucket_list_item.save

SELECT  "bucket_list_items".* FROM "bucket_list_items" WHERE "bucket_list_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bucket_list_items" WHERE "bucket_list_items"."id" = $1  [["id", 1]]
---
    def destroy
        @bucket_list_item = BucketListItem.find(params[:id])
        @bucket_list_item.delete

SELECT  "bucket_list_items".* FROM "bucket_list_items" WHERE "bucket_list_items"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "bucket_list_items" SET "url" = $1, "updated_at" = $2 WHERE "bucket_list_items"."id" = $3  [["url", "asdfadsfasdfasdfadsfasdfasdfasdfasdfadsf"], ["updated_at", "2020-05-10 03:51:20.120282"], ["id", 3]]
---
    def update
        @bucket_list_item = BucketListItem.find(params[:id])
        if @bucket_list_item.update(bucket_list_item_params)