app/controllers/application_controller.rb

    def current_user
        return nil unless session[:session_token]
        @current_user ||= User.find_by(session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "8bhd0JzMjLygNJTSbHDCIw"], ["LIMIT", 1]]