app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "5WMhx-eBTvBYeShmytm_bw"], ["updated_at", "2020-05-07 03:50:15.500310"], ["id", 1]]
---
    def reset_session_token
        self.session_token = SecureRandom::urlsafe_base64(16)
        self.save!